IDENTIFICATION DIVISION.
PROGRAM-ID. CHARMASKUNMASK.

DATA DIVISION.
WORKING-STORAGE SECTION.
 01 WS-INOUT.
  02 WS-DATA            PIC X(100).
  02 WS-KEY             PIC 9(002).
  
 01 WS-ACTION           PIC X(001).
  88 WS-UNMASK    VALUE "U".
  88 WS-MASK      VALUE "M".
  
 01 WS-UNMASK-CHAR-SET  PIC X(036)
 VALUE "ABCDEFGHIJKLMNOPQRSTUVWXYZ1234567890".
 
 01 WS-MASKING-CHAR-SET PIC X(036).
  88 WS-M00 VALUE "alikdnrmtvyu271*)(><?:qopb8903456fgs".
  88 WS-M01 VALUE "lokijuhygtfrdeswaq[]{}<>?$#%*@98)(61".
  88 WS-MOT VALUE "azsxdcfvgbhnjmk,l.}{][)(><!@#$%&*548".


 
PROCEDURE DIVISION.

PGM-START.

DISPLAY "TEST: 1"
 INITIALIZE WS-INOUT

 MOVE 01 TO WS-KEY
 DISPLAY "WS-KEY: " WS-KEY
 
 PERFORM PROCESS-KEY-PARA THRU PROCESS-KEY-EXIT
 DISPLAY "WS-MASKING-CHAR-SET: " WS-MASKING-CHAR-SET
 
 MOVE "SOURAV KUMAR SAHU" TO WS-DATA
 DISPLAY "BEFORE MASKING: " WS-DATA
 MOVE "M" TO WS-ACTION
 PERFORM MASKING-PARA THRU MASKING-EXIT
 DISPLAY "AFTER MASKING: " WS-DATA
 MOVE "U" TO WS-ACTION
 PERFORM UNMASKING-PARA THRU UNMASKING-EXIT
 DISPLAY "AFTER UNMASKING: " WS-DATA

DISPLAY "" 
DISPLAY "TEST: 2"
 INITIALIZE WS-INOUT

 MOVE 02 TO WS-KEY
 DISPLAY "WS-KEY: " WS-KEY
 
 PERFORM PROCESS-KEY-PARA THRU PROCESS-KEY-EXIT
 DISPLAY "WS-MASKING-CHAR-SET: " WS-MASKING-CHAR-SET
 
 MOVE "SOURAV KUMAR SAHU" TO WS-DATA
 DISPLAY "BEFORE MASKING: " WS-DATA
 MOVE "M" TO WS-ACTION
 PERFORM MASKING-PARA THRU MASKING-EXIT
 DISPLAY "AFTER MASKING: " WS-DATA
 MOVE "U" TO WS-ACTION
 PERFORM UNMASKING-PARA THRU UNMASKING-EXIT
 DISPLAY "AFTER UNMASKING: " WS-DATA
 .
PGM-STOP.
 EXIT PROGRAM.
 
PROCESS-KEY-PARA.

 EVALUATE WS-KEY
 WHEN 00
  SET WS-M00 TO TRUE
 WHEN 01
  SET WS-M01 TO TRUE
 WHEN OTHER
  SET WS-MOT TO TRUE
 END-EVALUATE
 .
PROCESS-KEY-EXIT.
 EXIT.

MASKING-PARA.
 IF WS-MASK

  INSPECT WS-DATA CONVERTING
  WS-UNMASK-CHAR-SET
  TO
  WS-MASKING-CHAR-SET
 END-IF

 .
MASKING-EXIT.
 EXIT.
 
UNMASKING-PARA.
 IF WS-UNMASK

  INSPECT WS-DATA CONVERTING
  WS-MASKING-CHAR-SET
  TO
  WS-UNMASK-CHAR-SET

 END-IF.
UNMASKING-EXIT.
 EXIT.
