IDENTIFICATION DIVISION.
PROGRAM-ID. FIZZBUZZ.
DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 WS-STR PIC x(30).
   01 WS-CNT PIC 9(03).
   01 WS-DEVIDENT PIC 9(03).
   01 WS-REMAINDER PIC 9(03).
PROCEDURE DIVISION.
   FIRST-PARA.
   PERFORM VARYING WS-CNT FROM 1 BY 1 UNTIL WS-CNT >= 20
       INITIALIZE WS-STR
       DIVIDE WS-CNT BY 3 GIVING WS-DEVIDENT REMAINDER WS-REMAINDER
       IF WS-REMAINDER = 0
           STRING
              WS-STR DELIMITED BY SPACE
              "FIZZ" DELIMITED BY SIZE
              INTO WS-STR
           END-STRING
       END-IF
       DIVIDE WS-CNT BY 5 GIVING WS-DEVIDENT REMAINDER WS-REMAINDER
       IF WS-REMAINDER = 0
           STRING
              WS-STR DELIMITED BY SPACE
              "BUZZ" DELIMITED BY SIZE
              INTO WS-STR
           END-STRING
       END-IF
       IF WS-STR = SPACES
           MOVE WS-CNT TO WS-STR
       END-IF
       DISPLAY WS-STR
   END-PERFORM
 STOP RUN.
