IDENTIFICATION DIVISION.
PROGRAM-ID. LEVEL88.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 CHAR PIC X.
 88 UPPER VALUE 'A' THRU 'Z'.
 88 LOWER VALUE 'a' THRU 'z'.
 88 NUMB  VALUE '0' THRU '9'.
 88 ALPHNUM VALUE 'A' THRU 'Z', 'a' THRU 'z', '0' THRU '9'.

01 ADDRES.
 02 BUILD PIC X(5) VALUE 'GAGANA'.
 02 PLOT  PIC 9(2) VALUE  63.
 02 LOC   PIC X(5) VALUE 'THANE'.
 02 STATE PIC X(5) VALUE 'MAHA'.
 02 COUNTRY PIC X(5) VALUE 'INDIA'.
 66 GEOLOC RENAMES PLOT THRU STATE.

PROCEDURE DIVISION.

DISPLAY GEOLOC

MOVE 'g' TO CHAR

IF UPPER
DISPLAY "UPPER"
END-IF

IF LOWER
DISPLAY "LOWER"
END-IF

IF NUMB
DISPLAY "NUMBER"
END-IF

IF ALPHNUM
DISPLAY "ALPHANUM"
END-IF

DISPLAY 'Hello, world'.
STOP RUN.
